// Задание 3
Console.Write("Введите первое число a = ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите второе число b = ");
int b = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите третье число c = ");
int c = Convert.ToInt32(Console.ReadLine());
int max = 0;
if (a > max) max = a;
if (b > max) max = b;
if (c > max) max = c;
Console.Write("Максимальное число = ");
Console.Write(max);