// Задача 2
Console.Write("Введите первое число a = ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите второе число b = ");
int b = Convert.ToInt32(Console.ReadLine());
if (a > b)
{
    Console.WriteLine("число a больше числа b ");
}
else
{
    Console.WriteLine("число b больше числа a ");
}
